app/controllers/properties_controller.rb

INSERT INTO "properties" ("account_id", "name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 4], ["name", ""], ["address", ""], ["created_at", "2021-05-13 15:32:39.924084"], ["updated_at", "2021-05-13 15:32:39.924084"]]
---
  def create
    @property = Property.new(property_params)
    @property.account_id = current_account.id

    respond_to do |format|
      if @property.save